adventure-works/schemaspy/diagrams/tables/FactResellerSales.1degree.dot
digraph "oneDegreeRelationshipsDiagram" {
  graph [    rankdir="RL"    bgcolor="#ffffff"    label="\nGenerated by SchemaSpy"    labeljust="l"    nodesep="0.18"    ranksep="0.46"    fontname="Helvetica"    fontsize="11"    ration="compress"  ];  node [    fontname="Helvetica"    fontsize="11"    shape="plaintext"  ];  edge [    arrowsize="0.8"  ];
  "DimEmployee":"SalesTerritoryKey":w -> "DimSalesTerritory":"SalesTerritoryKey":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactResellerSales":"CurrencyKey":w -> "DimCurrency":"CurrencyKey":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactResellerSales":"DueDateKey":w -> "DimDate":"DateKey":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactResellerSales":"EmployeeKey":w -> "DimEmployee":"EmployeeKey":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactResellerSales":"OrderDateKey":w -> "DimDate":"DateKey":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactResellerSales":"ProductKey":w -> "DimProduct":"ProductKey":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactResellerSales":"PromotionKey":w -> "DimPromotion":"PromotionKey":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactResellerSales":"ResellerKey":w -> "DimReseller":"ResellerKey":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactResellerSales":"SalesTerritoryKey":w -> "DimSalesTerritory":"SalesTerritoryKey":e [arrowhead=none dir=back arrowtail=crowodot];
  "FactResellerSales":"ShipDateKey":w -> "DimDate":"DateKey":e [arrowhead=none dir=back arrowtail=crowodot];
  "DimCurrency" [
   label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="3"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="78" HEIGHT="16"><B>DimCurrency</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="CurrencyKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="133" HEIGHT="16">CurrencyKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="CurrencyAlternateKey" COLSPAN="3" BGCOLOR="#ffffff" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="133" HEIGHT="16">CurrencyAlternateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="elipses" COLSPAN="3" ALIGN="LEFT">...</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">  </TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">105 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">4 &gt;</TD></TR>
    </TABLE>>
    URL="DimCurrency.html"
    target="_top"
    tooltip="DimCurrency"
  ];
  "DimDate" [
   label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="3"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="52" HEIGHT="16"><B>DimDate</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="DateKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="153" HEIGHT="16">DateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="FullDateAlternateKey" COLSPAN="3" BGCOLOR="#ffffff" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="153" HEIGHT="16">FullDateAlternateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="elipses" COLSPAN="3" ALIGN="LEFT">...</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">  </TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">3,652 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">12 &gt;</TD></TR>
    </TABLE>>
    URL="DimDate.html"
    target="_top"
    tooltip="DimDate"
  ];
  "DimEmployee" [
   label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="3"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="82" HEIGHT="16"><B>DimEmployee</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="EmployeeKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">EmployeeKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ParentEmployeeKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">ParentEmployeeKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SalesTerritoryKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="242" HEIGHT="16">SalesTerritoryKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="elipses" COLSPAN="3" ALIGN="LEFT">...</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">&lt; 2</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">296 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">3 &gt;</TD></TR>
    </TABLE>>
    URL="DimEmployee.html"
    target="_top"
    tooltip="DimEmployee"
  ];
  "DimProduct" [
   label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="3"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="71" HEIGHT="16"><B>DimProduct</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ProductKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">ProductKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ProductAlternateKey" COLSPAN="3" BGCOLOR="#ffffff" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">ProductAlternateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ProductSubcategoryKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">ProductSubcategoryKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="StartDate" COLSPAN="3" BGCOLOR="#ffffff" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="149" HEIGHT="16">StartDate</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="elipses" COLSPAN="3" ALIGN="LEFT">...</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">&lt; 1</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">606 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">3 &gt;</TD></TR>
    </TABLE>>
    URL="DimProduct.html"
    target="_top"
    tooltip="DimProduct"
  ];
  "DimPromotion" [
   label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="3"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="88" HEIGHT="16"><B>DimPromotion</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="PromotionKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="164" HEIGHT="16">PromotionKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="PromotionAlternateKey" COLSPAN="3" BGCOLOR="#ffffff" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="164" HEIGHT="16">PromotionAlternateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="elipses" COLSPAN="3" ALIGN="LEFT">...</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">  </TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">16 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">2 &gt;</TD></TR>
    </TABLE>>
    URL="DimPromotion.html"
    target="_top"
    tooltip="DimPromotion"
  ];
  "DimReseller" [
   label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="3"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="72" HEIGHT="16"><B>DimReseller</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ResellerKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="126" HEIGHT="16">ResellerKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="GeographyKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="126" HEIGHT="16">GeographyKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ResellerAlternateKey" COLSPAN="3" BGCOLOR="#ffffff" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="126" HEIGHT="16">ResellerAlternateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="elipses" COLSPAN="3" ALIGN="LEFT">...</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">&lt; 1</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">701 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">1 &gt;</TD></TR>
    </TABLE>>
    URL="DimReseller.html"
    target="_top"
    tooltip="DimReseller"
  ];
  "DimSalesTerritory" [
   label=<
    <TABLE BORDER="0" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="3"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="108" HEIGHT="16"><B>DimSalesTerritory</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SalesTerritoryKey" COLSPAN="3" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="163" HEIGHT="16">SalesTerritoryKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="SalesTerritoryAlternateKey" COLSPAN="3" BGCOLOR="#ffffff" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="163" HEIGHT="16">SalesTerritoryAlternateKey</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="elipses" COLSPAN="3" ALIGN="LEFT">...</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">  </TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">11 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">4 &gt;</TD></TR>
    </TABLE>>
    URL="DimSalesTerritory.html"
    target="_top"
    tooltip="DimSalesTerritory"
  ];
  "FactResellerSales" [
   label=<
    <TABLE BORDER="2" CELLBORDER="1" CELLSPACING="0" BGCOLOR="#ffffff">
      <TR><TD COLSPAN="4"  BGCOLOR="#f5f5f5"><TABLE BORDER="0" CELLSPACING="0"><TR><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="103" HEIGHT="16"><B>FactResellerSales</B></TD><TD ALIGN="RIGHT">[table]</TD></TR></TABLE></TD></TR>
      <TR><TD PORT="ProductKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">ProductKey</TD></TR></TABLE></TD><TD PORT="ProductKey.type" ALIGN="LEFT">int[4]</TD></TR>
      <TR><TD PORT="OrderDateKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">OrderDateKey</TD></TR></TABLE></TD><TD PORT="OrderDateKey.type" ALIGN="LEFT">int[4]</TD></TR>
      <TR><TD PORT="DueDateKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">DueDateKey</TD></TR></TABLE></TD><TD PORT="DueDateKey.type" ALIGN="LEFT">int[4]</TD></TR>
      <TR><TD PORT="ShipDateKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">ShipDateKey</TD></TR></TABLE></TD><TD PORT="ShipDateKey.type" ALIGN="LEFT">int[4]</TD></TR>
      <TR><TD PORT="ResellerKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">ResellerKey</TD></TR></TABLE></TD><TD PORT="ResellerKey.type" ALIGN="LEFT">int[4]</TD></TR>
      <TR><TD PORT="EmployeeKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">EmployeeKey</TD></TR></TABLE></TD><TD PORT="EmployeeKey.type" ALIGN="LEFT">int[4]</TD></TR>
      <TR><TD PORT="PromotionKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">PromotionKey</TD></TR></TABLE></TD><TD PORT="PromotionKey.type" ALIGN="LEFT">int[4]</TD></TR>
      <TR><TD PORT="CurrencyKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">CurrencyKey</TD></TR></TABLE></TD><TD PORT="CurrencyKey.type" ALIGN="LEFT">int[4]</TD></TR>
      <TR><TD PORT="SalesTerritoryKey" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/foreignKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">SalesTerritoryKey</TD></TR></TABLE></TD><TD PORT="SalesTerritoryKey.type" ALIGN="LEFT">int[4]</TD></TR>
      <TR><TD PORT="SalesOrderNumber" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">SalesOrderNumber</TD></TR></TABLE></TD><TD PORT="SalesOrderNumber.type" ALIGN="LEFT">nvarchar[40]</TD></TR>
      <TR><TD PORT="SalesOrderLineNumber" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"><IMG SRC="../../images/primaryKeys.png"/></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">SalesOrderLineNumber</TD></TR></TABLE></TD><TD PORT="SalesOrderLineNumber.type" ALIGN="LEFT">tinyint[1]</TD></TR>
      <TR><TD PORT="RevisionNumber" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">RevisionNumber</TD></TR></TABLE></TD><TD PORT="RevisionNumber.type" ALIGN="LEFT">tinyint[1]</TD></TR>
      <TR><TD PORT="OrderQuantity" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">OrderQuantity</TD></TR></TABLE></TD><TD PORT="OrderQuantity.type" ALIGN="LEFT">smallint[2]</TD></TR>
      <TR><TD PORT="UnitPrice" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">UnitPrice</TD></TR></TABLE></TD><TD PORT="UnitPrice.type" ALIGN="LEFT">money[21,4]</TD></TR>
      <TR><TD PORT="ExtendedAmount" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">ExtendedAmount</TD></TR></TABLE></TD><TD PORT="ExtendedAmount.type" ALIGN="LEFT">money[21,4]</TD></TR>
      <TR><TD PORT="UnitPriceDiscountPct" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">UnitPriceDiscountPct</TD></TR></TABLE></TD><TD PORT="UnitPriceDiscountPct.type" ALIGN="LEFT">float[8]</TD></TR>
      <TR><TD PORT="DiscountAmount" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">DiscountAmount</TD></TR></TABLE></TD><TD PORT="DiscountAmount.type" ALIGN="LEFT">float[8]</TD></TR>
      <TR><TD PORT="ProductStandardCost" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">ProductStandardCost</TD></TR></TABLE></TD><TD PORT="ProductStandardCost.type" ALIGN="LEFT">money[21,4]</TD></TR>
      <TR><TD PORT="TotalProductCost" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">TotalProductCost</TD></TR></TABLE></TD><TD PORT="TotalProductCost.type" ALIGN="LEFT">money[21,4]</TD></TR>
      <TR><TD PORT="SalesAmount" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">SalesAmount</TD></TR></TABLE></TD><TD PORT="SalesAmount.type" ALIGN="LEFT">money[21,4]</TD></TR>
      <TR><TD PORT="TaxAmt" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">TaxAmt</TD></TR></TABLE></TD><TD PORT="TaxAmt.type" ALIGN="LEFT">money[21,4]</TD></TR>
      <TR><TD PORT="Freight" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">Freight</TD></TR></TABLE></TD><TD PORT="Freight.type" ALIGN="LEFT">money[21,4]</TD></TR>
      <TR><TD PORT="CarrierTrackingNumber" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">CarrierTrackingNumber</TD></TR></TABLE></TD><TD PORT="CarrierTrackingNumber.type" ALIGN="LEFT">nvarchar[50]</TD></TR>
      <TR><TD PORT="CustomerPONumber" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">CustomerPONumber</TD></TR></TABLE></TD><TD PORT="CustomerPONumber.type" ALIGN="LEFT">nvarchar[50]</TD></TR>
      <TR><TD PORT="OrderDate" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">OrderDate</TD></TR></TABLE></TD><TD PORT="OrderDate.type" ALIGN="LEFT">datetime[16,3]</TD></TR>
      <TR><TD PORT="DueDate" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">DueDate</TD></TR></TABLE></TD><TD PORT="DueDate.type" ALIGN="LEFT">datetime[16,3]</TD></TR>
      <TR><TD PORT="ShipDate" COLSPAN="2" ALIGN="LEFT"><TABLE BORDER="0" CELLSPACING="0" ALIGN="LEFT"><TR ALIGN="LEFT"><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="15" HEIGHT="16"></TD><TD ALIGN="LEFT" FIXEDSIZE="TRUE" WIDTH="143" HEIGHT="16">ShipDate</TD></TR></TABLE></TD><TD PORT="ShipDate.type" ALIGN="LEFT">datetime[16,3]</TD></TR>
      <TR><TD ALIGN="LEFT" BGCOLOR="#ffffff">&lt; 9</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">60,855 rows</TD><TD ALIGN="RIGHT" BGCOLOR="#ffffff">0 &gt;</TD></TR>
    </TABLE>>
    URL="FactResellerSales.html"
    target="_top"
    tooltip="FactResellerSales"
  ];
}
